Repository: 84000/data-translation-memory
Catalog: toh248-v3.tmx
Source language: bo
Languages: en

source: ཆོས་བཞི་པོ་འདི་དག་གིས་ཀྱང་སློབ་དཔོན མཉེས་པར་བྱེད་དེ། བཞི་གང་ཞེ་ན། ངེས་པ་དང་བཤེས་པ་དང་། བཤེས་པ་བརྟན་པ་དང་། ཆོས་ལ་གནས་པ་དང་། ངེས་པའི་ཚིག་བཟང་པོ་དང་ལྡན་པ་སྟེ།
en: They are set at peace by their love.

source: ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་སློབ་དཔོན་མཉེས་པར་བྱེད་དོ། །
en: “When someone who has bathed

source: བདག་ཆོས་བཞི་དང་ལྡན་ན་དགའ་བ་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། བདག་གི་བཙལ་བ་དོན་ཡོད་པར་བདག་ཉིད་ཀྱིས་དགའ་བ་ཐོབ་པ་དང་། བདག་ཐོས་པའི་གཏེར་དང་ལྡན་པ་དང་། བདག་འདི་ལ་བརྟེན་ནས་ ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་ལྡན་པ་དང་། གཞན་དག་ལ་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པ་ན་དགའ་བ་དང་རངས་པ་སྐྱེ་བར་འགྱུར་ཏེ ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བདག་ཉིད་དགའ་བ་འཐོབ་པར་འགྱུར་རོ། ། དེ་དེ་ལྟ་བུར་ཐོས་པ་ཚོལ་བ་ལ་གུས་པ་དང་བཅས་པ་དང་། རི་མོ་དང་ལྡན་པ་དང་། སྲི་ཞུ་དང་ལྡན་པ་དང་། བདག་ཉིད་མི་འཕྱར་བ་དང་། བདག་ཉིད་དུལ་བའི་དོན་དང་། བདག་ཉིད་ཞི་བའི་དོན་དང་། བདག་ཉིད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་དོན་དང་། གཞན་དུལ་བའི་དོན་དང་། གཞན་ཞི་བའི་དོན་དང་། གཞན་མྱ་ངན་ལས་འདའ་བའི་དོན་བྱེད་པ་ཡིན་ཏེ བདག་གཅིག་པུའི་དོན་བྱེད་པ་ནི་མ་ཡིན་ནོ། ། དེ་ལྟར་ཐོས་པ་ཚོལ་ཞིང་དེ་ལྟར་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་ན་མཐོང་བའི་ཆོས་ཀྱི་ཤེས་རབ་ཀྱང་འཕེལ་བར་བྱེད་ན་འཇིག་རྟེན་ཕ་རོལ་གྱི་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ། ཤེས་རབ་དེ་ཡང་ཐོས་པ་ནན་ཏན་དུ་བྱེད་པས་སྒྲུབ་པ་ཡིན་ནོ། ། བྱང་ཆུབ་སེམས་དཔའ་ཐོས་པ་ལ་ནན་ཏན་དུ་སྒྲུབ་པར་མི་བྱེད་པ་དེས་ནི་སེར་སྐྱ་རྗེས་སུ་དྲན་པར་བྱའོ། །
en: Joyfully receives a garland,

source: དེ་བས་ན་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་དག་ལ་ཡང་གུས་པ་དང་བཅས་པར་བྱ། མདུན་དུ་གནས་ཏེ་འཕྱ་བར་མི་བྱ། སྨྲ་བར་མི་བྱ། རྐང་པ་བཀྲུ་བར་མི་བྱ། མདུན་དུ་སོ་ཤིང་བཟའ་བར་མི་བྱ།
en: That person accepts this gift with both hands

source: མདུན་དུ་མཆིལ་མ་དོར་བར་མི་བྱ། སྒྲ་དྲག་པོས་སྨྲ་བར་མི་བྱ། མ་དྲིས་པར་སྨྲ་བར་མི་བྱ། གཏམ་གྱི་བར་ཆད་མི་བྱ། མ་སྨྲས་པར་འགྲོ་བར་མི་བྱ། སྔ་ཕྱིའི་འདུ་ཤེས་མི་བྱ།
en: And places it on their crown.

source: གང་ཅུང་ཟད་ཙམ་རབ་ཏུ་སྨྲ་བར་མི་བྱ། གཞན་དང་གཞན་པའི་གཏམ་མི་བྱ།
en: “Similarly, the joy one might feel

source: དམན་པ་དང་ལྡན་པའི་གཏམ་མི་བྱ། གཞན་དྲིས་པ་ན་གཞན་གྱིས་བརྡ་སྤྲད་པར་མི་བྱ། གང་དྲིས་པ་དེ་ཉིད་བརྡ་སྤྲད་པར་བྱ། རྐུན་པོའི་གཏམ་མི་བྱ། མདོ་སྡེ་ལ་རྟོན་པར་བྱ། བདག་དང་གཞན་གྱི་སེམས་བསྲུང་བར་བྱ་ཞིང་དེ་དང་རྗེས་སུ་འཐུན་པའི་དགེ་བའི་རྩ་བ་བརྟེན་པར་བྱ། གང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཡང་དག་པ་ཉིད་ལ་ཞུགས་པ་དེ་རྣམས་ལ་ཕན་གདགས་པར་བྱ། གང་མ་ཞུགས་པ་རྣམས་ལ་ཡང་གནོད་པར་མི་བྱ།
en: From becoming the ruler of a kingdom

source: དེ་ལ་རྣམ་པ་དེ་དག་གཉི་ག་ལ་ཡང་གནོད་པར་མི་བྱའོ། ། གང་དག་ལ་བདག་ལ་ཁྲོས་པར་གྱུར་ནས་ ཡང་དག་པ་མ་ཡིན་པ་རྗོད་པར་བྱེད་ཅིང་སྲོག་གི་བར་ཆད་བྱེད་པར་གནས་པ། ཚངས་པར་སྤྱོད་པའི་བར་ཆད་བྱེད་པ་ལ་འཇིགས་པའམ། གུས་པར་བྱ་བ་དང་། ཐ་ན་དགའ་བའི་ཚིག་གིས་ཀྱང་དེ་དང་སེམས་ཡོངས་སུ་འདྲིས་པར་བྱ། གང་ལས་ལུང་ནོད་པ་དང་། ཁ་ཏོན་འདོན་པ་དང་འབྲེལ་པ་དེ་ལ་ནི་སྟོན་པའི་འདུ་ཤེས་བསྐྱེད་ཅིང་གུས་པར་བྱའོ། ། དེ་ལྟར་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་གུས་པར་ཡང་བྱའོ། ། ཇི་ལྟར་ལམ་བསྟན་པར་བྱ་ཞེ་ན། སེམས་མཉམ་པ་ཉིད་དང་། སེམས་རབ་ཏུ་དང་བ་ཉིད་དང་། ཡང་དག་པར་འདུ་ཤེས་པ་དང་། སོམ་ཉི་མེད་པས་ལམ་ལ་ལམ་ཉེ་བར་བསྟན་པར་བྱའོ། །
en: Is nothing compared to the joy

source: གལ་ཏེ་ཐེ་ཙོམ་མེད་པར་མ་གྱུར་ན་དེས་ལམ་ཤེས་པའི་སྐྱེས་བུ་དག་ལས་མཉན་ནས་ལམ་ཉེ་བར་བསྟན་པར་བྱའོ། ། ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། ། དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། ཚུལ་བཞིན་བསྙེན་བཀུར་བྱེད་པ་དང་། །ཚུལ་བཞིན་ཆོས་ནི་ཉན་བྱེད་ཅིང་། །ཚུལ་བཞིན་ཤིན་ཏུ་དོན་སེམས་ལ། །ཆོས་རྣམས་ཀུན་གྱི་ཕ་རོལ་ཕྱིན། ། ལུས་ཅན་རྣམས་ལ་ཕན་དོན་དུ། །ཆོས་དེ་ཡོངས་སུ་ཚོལ་བ་ན། །
en: Born from hearing the excellent teachings.

source: མཁན་པོ་དག་དང་ཉེ་གནས་ནི། །གུས་པ་ཀུན་གྱིས་བྱ་བ་ཡིན། ། རྟག་ཏུ་བྱམས་པ་ལ་གནས་ནས། ། བྱས་པ་གཟོ་དང་བྱས་པ་ཚོར། ། ངོ་ཚ་ཁྲེལ་ཡོད་ཕུན་སུམ་ཚོགས། །ཕྲག་དོག་ཚུལ་འཆོས་རྣམ་པར་སྤངས། ། ནད་པ་རྣམས་ནི་གསོ་བྱེད་པ། །རྙེད་དཀའ་རིན་ཆེན་འདུ་ཤེས་ཀྱིས། །དེ་དག་འདུ་ཤེས་ཉེར་གཞག་ནས། ། ལེགས་པར་བཤད་པ་ཡོངས་སུ་བཙལ། །དེ་དག་ཐོས་པས་བདེར་འགྱུར་དང་། །ཤེས་རབ་རྣོན་པོའང་སྐྱེ་འགྱུར་ཞིང་། །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་དག ། ཐམས་ཅད་བྱམས་པས་ཞི་བར་འགྱུར། ། དཔེར་ན་སྐྱེས་བུ་ཁྲུས་བྱས་ལ། །འགའ་ཡིས་ཕྲེང་བ་བྱིན་པ་ན། ། ལག་པ་གཉིས་ཀྱིས་ཡོན་བླངས་ནས། ། སྤྱི་བོ་ལ་ནི་འཇོག་པ་ལྟར། །དེ་བཞིན་ལེགས་བཤད་ཐོས་ནས་ ཀྱང་། །དགའ་བའི་སེམས་ནི་སྐྱེ་འགྱུར་བ། །རྒྱལ་སྲིད་ཐོབ་པའང་དེ་ལྟ་བུའི། །དགའ་བ་རྙེད་པ་མ་ཡིན་ནོ། །
en: “They always venerate as supreme

source: རྟག་ཏུ་དེ་དག་ཆོས་སྨྲ་ལ། །མཆོག་ཏུ་བླ་མར་བྱ་བ་ཡིན། །
en: Those who propound the Dharma.

source: ཆོས་ནི་རྫོགས་སངས་རྒྱལ་མཚན་ཏེ། །
en: The Dharma is the banner of the perfect buddhas;

source: ཆོས་ནི་དགྲ་བཅོམ་རྒྱལ་མཚན་ཡིན། །
en: The Dharma is the banner of the worthy ones.

source: སངས་རྒྱས་ཆོས་རྣམས་ཐོས་ནས་ཀྱང་། །བསྒྲུབ་པ་དག་ལ་རབ་གནས་ཤིང་། །ཚུལ་ཁྲིམས་ཐོས་པས་ངེས་འབྱུང་སྟེ། །
en: “After hearing the teachings of the buddhas, They abide in their accomplishment. When they hear about discipline,

source: དཔེར་ན་ཡར་ངོའི་ཟླ་བ་བཞིན། །མི་རྨོངས་ཞེ་སྡང་མེད་པ་ཡིས། །ལམ་མཆོག་དག་ནི་བསྟེན་པ་དང་། །བྱིས་པ་གང་ལ་གུས་བཅས་པའི། །ལྟ་བའི་གནས་ཀྱང་རྣམ་པར་སྤང་། །
en: Their renunciation grows like the waxing moon. “Undeluded and free of anger, They follow the supreme paths And relinquish that which immature beings Keep regarding with respect.

source: སེང་གེས་སྤངས་པའི་ཝ་བཞིན་དུ། །ཟིལ་གྱིས་མནན་པས་ཆོས་རྣམས་འཆད། །
en: “Like a lion overcomes a fox, They expound the teachings with overwhelming splendor.

source: རླུང་གིས་སྤྲིན་གྱི་ཚོགས་བཞིན་དུ། །མུ་སྟེགས་ཅན་དེ་ཟིལ་གྱིས་མནན། །
en: Like wind buffeting banks of clouds, They outshine the tīrthikas.

source: ས་ལ་སྤྲིན་གྱི་ཚོགས་བཞིན་དུ། །ཆོས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད། །
en: “Like rainclouds above the earth, They bring satisfaction to beings through the Dharma,

source: སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ནི། །སྨན་པའི་རྒྱལ་པོ་བཞིན་དུ་སེལ། །
en: Like the King of Physicians Who quells the suffering of beings.

source: སེམས་ནི་རྩེ་གཅིག་མཉམ་བཞག་པས། །དེ་དག་རྣམ་རྟོག་སྤྱོད་ཡུལ་མིན། །
en: “Settled in one-pointed equipoise, Their minds are not involved in discursive thinking.

source: དེ་དག་ཁྲོ་བ་ལྷུར་མི་ལེན། ། འཕྱར་བ་ལ་ཡང་མི་གནས་སོ། །
en: They never indulge in anger,

source: དུས་དང་དུས་མིན་རྣམ་ཤེས་ཤིང་། །དོན་ཤེས་པ་ཡིས་རྣམ་པར་འདྲེན། །རྟག་ཏུ་བཟོད་སྟོབས་ལ་དགའ་རྣམས། །ཤེས་པའི་ལས་རྣམས་བྱེད་པར་འགྱུར། །
en: And they never glorify themselves. “They guide others while knowing What is timely, what is untimely, and what is meaningful. Ever delighting in the strength of patience They engage in the activity of knowledge.

source: མཁས་དང་མཐུ་ལ་བརྟན་པ་དང་། །ཆོས་ཤེས་པ་ལ་མཁས་པ་དང་། །དཔའ་ཞིང་སེམས་སྟོབས་ཆེ་བ་སྟེ། །
en: “Firm in their mastery and power, Learned in the knowledge of the Dharma, Heroic and with vast strength of mind,

source: རླུང་གིས་ཆང་བའི་རྡུལ་བཞིན་དུ། །སྡིག་ཅན་རྣམས་ནི་ཟིལ་གྱིས་གནོན། །
en: Like wind scattering dust They overpower the wicked ones .

source: ཕྱོགས་རྣམས་དག་ཏུ་གསལ་གནས་པ། །ཉི་མ་འཆར་བ་ཇི་བཞིན་ནོ། །
en: “Just as it is out in all directions That the rising sun shines brightly,

source: མཁས་པ་དེ་དག་རང་དོན་ལ། །ཆེད་དུ་སྨྲ་བ་བརྗོད་མི་བྱེད། །
en: So too it is not for their own sake That the wise ones choose to speak.

source: འཇིག་རྟེན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །བསམ་གཏན་མངོན་ཤེས་དག་ལ་མཁས། །
en: “In order to benefit the people of the world, They master the concentrations and the higher perceptions.

source: དེ་དག་རྣམ་པ་འདི་འདྲ་བས། །བདུད་ཀྱི་སྟེང་ན་གནས་པ་ཡིན། །
en: With such a mastery, They dwell above the māras.

source: སེམས་ཅན་རྣམས་ལ་བརྩེ་བའི་ཕྱིར། །འཇིག་རྟེན་མར་མེ་བྱེད་ཅིང་རྒྱུ། །ཤཱ་རིའི་བུ་གཞན་ཡང་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་སྒྲུབ་པ་ཡིན་ཏེ།
en: “Out of affection for sentient beings They act as lanterns as they move about in the world.

source: བཞི་གང་ཞེ་ན། གུས་པས་ཚུལ་ཁྲིམས་སྲུང་ཞིང་སོ་སོར་ཐར་པ་ལ་ཁྱད་དུ་མི་གསོད་པ་དང་། གུས་པས་བྱམས་པ་སྒོམ་པར་བྱེད་ཅིང་གནོད་སེམས་ལ་སྦྱོར་བར་ཡང་སྤོང་བར་བྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ལ་འདུན་པ་དྲག་པོ་སྐྱེད་པར་ཡང་བྱེད་པ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་གཅེས་པ་མི་འདོར་བ་སྟེ། ཤཱ་རིའི་བུ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་སྒྲུབ་པ་ཡིན་ནོ། །
en: “Furthermore, Śāriputra, bodhisattvas who have four qualities will accomplish patience. What are these four? Guarding one’s discipline respectfully and not disparaging the prātimokṣa, cultivating love with respect and renouncing ill will, arousing fervent longing for omniscience, and never ceasing to treasure virtuous qualities. Śāriputra, bodhisattvas who have these four qualities will accomplish patience.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ། བདེ་བར་གཤེགས་པས་དེ་སྐད་གསུངས་ནས། སྟོན་པས་གཞན་ཡང་འདི་སྐད་བཀའ་སྩལ་ཏོ། །
en: After the Blessed One had said these words, after the Well-Gone One had spoken thus, the Teacher said further:

source: དེ་དག་སངས་རྒྱས་ཀྱིས་བསྔགས་པའི། །ཚུལ་ཁྲིམས་མ་ཉམས་མ་རལ་སྲུང་། །
en: “They maintain the uncorrupted, unbroken discipline That is praised by the buddhas,

source: ཚུལ་ཁྲིམས་ཕུང་པོ་དག་པ་ལ། །དགའ་བ་ཉེ་བར་སྐྱེ་བར་འགྱུར། །
en: And they take delight In the pure component of discipline.

source: ཆོས་རྣམས་མང་པོ་ཚོལ་བྱེད་ཅིང་། །ཐོས་པ་མང་ལ་ལེགས་གནས་ན། །
en: “They seek out many teachings And are well established in erudition.

source: གང་གིས་ཐེ་ཙོམ་གཅོད་བྱེད་པའི། །དེས་དེའི་ཤེས་རབ་འཕེལ་བར་འགྱུར། །
en: Thereby they eliminate their doubts And their insight expands.

source: སྐྱེ་དང་འཆི་བའི་རྒྱུན་དག་ལས། །འདི་དག་ཇི་ལྟར་དགྲོལ་བྱ་ཞེས། །ལྟོས་མེད་ཕན་པའི་སེམས་དག་གིས། །དམ་པའི་ཆོས་ཀྱང་སྟོན་པར་བྱེད། །
en: “They teach the holy Dharma With unremitting benevolence, wondering, ‘How can I liberate beings From the rivers of birth and death?’

source: གནོད་སེམས་དོན་དུ་མི་གཉེར་བས། །བྱམས་པའི་སེམས་ཀྱང་སྒོམ་པར་བྱེད། །
en: “Turning away from ill will, They cultivate love.

source: མི་འཇིགས་པ་དང་ཕན་པའི་སེམས། །བདག་དང་སེམས་ཅན་མཉམ་པ་ཉིད། །བྱང་ཆུབ་ལ་བརྟེན་ཟིལ་གནོན་པའི། །བརྩོན་པ་དག་ཀྱང་ལེགས་པར་རྩོམ། །
en: Fearless and benevolent, They regard themselves and others as equal. “They fully apply themselves With surpassing diligence aimed at awakening,

source: གང་དག་བྱང་ཆུབ་ལ་རྟེན་པའི། །དགེ་བའི་ཆོས་རྣམས་ཚོལ་བ་དང་། །བསྒོམ་པར་བྱ་བ་སྒོམ་པ་དང་། །སྤང་བར་བྱ་བའང་རྣམ་པར་སྤོང་། །
en: And they seek out virtuous qualities That are aimed at awakening. “They cultivate what must be cultivated, And abandon what must be abandoned.

source: ཇི་ལྟར་སྤང་བྱ་སྤངས་པ་ཡིས། །མྱུར་དུ་མྱ་ངན་འདའ་བར་འགྱུར། །
en: As they abandon what must be abandoned, They will quickly attain nirvāṇa.

source: དགོན་པའི་གནས་ལ་མངོན་ཕྱོགས་ཤིང་། །གནོད་པ་དག་ལ་རྒྱབ་ཀྱིས་ཕྱོགས། །
en: “Facing the wilderness, They turn their back on troubles.

source: ཐོས་པ་ཚོལ་ལ་བརྩོན་པ་དག །
en: Those who strive to seek out learning

source: གོ་འཕང་མཆོག་ནི་རྟོགས་པར་འགྱུར། །
en: Will realize the supreme state.

source: དགེ་སློང་དགེ་སློང་མ་རྣམས་དང་། །དགེ་བསྙེན་དེ་བཞིན་དགེ་བསྙེན་མ། །ཐམས་ཅད་དང་ནི་དེ་དག་གིས། །འདྲིས་པ་རྣམ་པར་སྤང་བར་བྱ། །
en: “Monks, nuns, Laymen, and laywomen— Everyone should give up What they are familiar with.

source: བྱིས་པའི་ལམ་ལ་རྟེན་པ་ཡི། །རྨོངས་པ་ཀུན་ཀྱང་སྐྱབས་མེད་དེ། །
en: “All the fools who follow the path of the immature Are without a refuge,

source: གང་ཞིག་ཆོས་ལ་རྟེན་པ་དང་། །དེ་དག་སངས་རྒྱས་མཆོག་ཏུ་གཞོལ། །མི་གང་སེམས་ཅན་དོན་དགའ་བའི། །སངས་རྒྱས་ཕ་དང་མ་ཡིན་ནོ། །
en: While those who follow the Dharma Dedicate themselves to supreme buddhahood. “Those who delight in the welfare of sentient beings Are the fathers and mothers of the buddhas.

source: གཡོ་མེད་ཆོས་ལ་འདོད་པ་དག །
en: Those who wish for the Dharma without deceit

source: བྱང་ཆུབ་ལ་ནི་རབ་ཏུ་དད། །
en: Have the utmost faith in awakening.

source: སངས་རྒྱས་དག་ཏུ་མི་ལྟ་བའི། །མི་རྣམས་མཚན་ཉིད་གསུམ་གསུངས་ཏེ། །
en: “Those who do not see the buddhas purely Are said to have three characteristics:

source: གཡོ་དང་ཆོས་མིན་འདོད་པ་དང་། །སྙོམ་ལས་དག་ལས་རྟག་དགའ་བའོ། །
en: Deceit, wishing for what is not the Dharma, And constantly reveling in indolence.

source: འདོད་ཆགས་ཞེ་སྡང་ང་རྒྱལ་དང་། །དེ་བཞིན་སྡིག་པ་རབ་སྤངས་ནས། །
en: “Having abandoned Desire, anger, pride, and harmful actions,

source: བློ་ལྡན་བརྩོན་འགྲུས་ལྡན་གྱུར་པ། །བྱང་ཆུབ་ལ་ནི་རབ་གུས་འགྱུར། །
en: The wise ones endowed with diligence Will be fully devoted to awakening.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: When the Blessed One finished speaking, venerable Śāriputra and the world with its gods, humans, asuras, and gandharvas rejoiced and praised what the Blessed One had said.

source: བྱང་ཆུབ་སེམས་དཔའི་སོ་སོར་ཐར་པ་ཆོས་བཞི་སྒྲུབ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the Mahāyāna sūtra “The Fourfold Accomplishments: The Bodhisattvas’ Prātimokṣa.”

source: རྒྱ་གར་གྱི་མཁན་པོ་དཱི་པཾ་ཀ་ར་ཤྲཱི་ཛྙཱ་ན་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་དགེ་སློང་ཤཱཀྱ་བློ་གྲོས་དང་། དགེ་སློང་དགེ་བའི་བློ་གྲོས་ཀྱིས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།​།
en: Translated, edited, and finalized by the Indian preceptor Dīpaṅkaraśrījñāna, together with the chief editors and translators, the monks Śākya Lodrö and Gewé Lodrö.
